hw4/blog/app/controllers/comments_controller.rb

  def create
    @article = Article.find(params[:article_id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]

  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)
---
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "name"], ["body", "comments"], ["article_id", 11], ["created_at", "2018-02-09 00:53:47.207128"], ["updated_at", "2018-02-09 00:53:47.207128"]]